YuzukiHD/TinyVision/kernel/linux-4.9/drivers/net/wireless/rtl8733bs/hal/rtl8733b/rtl8733b_ops.c
void rtl8733b_fill_txdesc_phy(PADAPTER adapter, struct pkt_attrib *pattrib, u8 *ptxdesc)
{
	if (pattrib->ht_en) {
		/* Set Bandwidth and sub-channel settings. */
		SET_TX_DESC_DATA_BW_8733B(ptxdesc, rtl8733b_bw_mapping(adapter, pattrib));
		SET_TX_DESC_DATA_SC_8733B(ptxdesc, rtl8733b_sc_mapping(adapter, pattrib));
	}
}

/**
 * rtl8733b_fill_txdesc_tx_rate() - Set rate in tx description
 * @adapter	struct _ADAPTER*
 * @attrib	packet attribute
 * @rate	DESC_RATE*
 * @shrt	1/0 means short/long PLCP for CCK, short/long GI for HT/VHT
 * @fallback	enable rate fallback or not
 * @desc	buffer of tx description
 *
 * Fill rate related fields of tx description when driver want to use specific
 * data rate to send this packet.
 */
static void rtl8733b_fill_txdesc_tx_rate(struct _ADAPTER *adapter,
				struct pkt_attrib *attrib,
				u8 rate, u8 shrt, u8 fallback, u8 *desc)
{
	u8 disfb;
	u8 bw;


	rate = rate & 0x7F;
	shrt = shrt ? 1 : 0;
	disfb = fallback ? 0 : 1;

	SET_TX_DESC_USE_RATE_8733B(desc, 1);
	SET_TX_DESC_DATARATE_8733B(desc, rate);
	SET_TX_DESC_DATA_SHORT_8733B(desc, shrt);
	SET_TX_DESC_DISDATAFB_8733B(desc, disfb);

	/* HT MCS rate can't support bandwidth higher than 40MHz */
	bw = GET_TX_DESC_DATA_BW_8733B(desc);
	if (((rate >= DESC_RATEMCS0) && (rate <= DESC_RATEMCS31)) && (bw > 1)) {
		RTW_WARN(FUNC_ADPT_FMT ": Use HT rate(%s) on bandwidth "
			 "higher than 40MHz(%u>%u) is illegal, "
			 "switch bandwidth to 40MHz!\n",
			 FUNC_ADPT_ARG(adapter),
			 HDATA_RATE(rate), attrib->bwmode,
			 CHANNEL_WIDTH_40);

		if (attrib->bwmode > CHANNEL_WIDTH_40)
			attrib->bwmode = CHANNEL_WIDTH_40;
		rtl8733b_fill_txdesc_phy(adapter, attrib, desc);
	}
}

#ifdef CONFIG_CONCURRENT_MODE
void rtl8733b_fill_txdesc_force_bmc_camid(struct pkt_attrib *pattrib, u8 *ptxdesc)
{
	if ((pattrib->encrypt > 0) && (!pattrib->bswenc)
	    && (pattrib->bmc_camid != INVALID_SEC_MAC_CAM_ID)) {
		SET_TX_DESC_EN_DESC_ID_8733B(ptxdesc, 1);
		SET_TX_DESC_MACID_8733B(ptxdesc, pattrib->bmc_camid);
	}
}
#endif

void rtl8733b_fill_txdesc_bmc_tx_rate(struct pkt_attrib *pattrib, u8 *ptxdesc)
{
	SET_TX_DESC_USE_RATE_8733B(ptxdesc, 1);
	SET_TX_DESC_DATARATE_8733B(ptxdesc, MRateToHwRate(pattrib->rate));
	SET_TX_DESC_DISDATAFB_8733B(ptxdesc, 1);
}

/*
 * Description:
 *	Fill tx description for beamforming packets
 */
void rtl8733b_fill_txdesc_bf(struct xmit_frame *frame, u8 *desc)
{
#ifndef CONFIG_BEAMFORMING
	return;
#else /* CONFIG_BEAMFORMING */
	struct pkt_attrib *attrib;


	attrib = &frame->attrib;

	SET_TX_DESC_G_ID_8733B(desc, attrib->txbf_g_id);
	SET_TX_DESC_P_AID_8733B(desc, attrib->txbf_p_aid);

	SET_TX_DESC_MU_DATARATE_8733B(desc, MRateToHwRate(attrib->rate));
	/*SET_TX_DESC_MU_RC_8733B(desc, 0);*/

	/* Force to disable STBC when txbf is enabled */
	if (attrib->txbf_p_aid && attrib->stbc)
		SET_TX_DESC_DATA_STBC_8733B(desc, 0);
#endif /* CONFIG_BEAMFORMING */
}

/*
 * Description:
 *	Fill tx description for beamformer,
 *	include following management packets:
 *	1. VHT NDPA
 *	2. HT NDPA
 *	3. Beamforming Report Poll
 */
void rtl8733b_fill_txdesc_mgnt_bf(struct xmit_frame *frame, u8 *desc)
{
#ifndef CONFIG_BEAMFORMING
	return;
#else /* CONFIG_BEAMFORMING */
	PADAPTER adapter;
	struct pkt_attrib *attrib;
	u8 ndpa = 0;
	u8 ht_ndpa = 0;
	u8 report_poll = 0;


	adapter = frame->padapter;
	attrib = &frame->attrib;

	if (attrib->subtype == WIFI_NDPA)
		ndpa = 1;
	if ((attrib->subtype == WIFI_ACTION_NOACK) && (attrib->order == 1))
		ht_ndpa = 1;
	if (attrib->subtype == WIFI_BF_REPORT_POLL)
		report_poll = 1;

	if ((!ndpa) && (!ht_ndpa) && (!report_poll))
		return;

	/*SET_TX_DESC_TXPKTSIZE_8733B(desc, pattrib->last_txcmdsz);*/
	/*SET_TX_DESC_OFFSET_8733B(desc, HALMAC_TX_DESC_SIZE_8733B);*/
	SET_TX_DESC_DISRTSFB_8733B(desc, 1);
	SET_TX_DESC_DISDATAFB(desc, 1);
	/*SET_TX_DESC_SW_SEQ_8733B(desc, pattrib->seqnum);*/
	SET_TX_DESC_DATA_BW_8733B(desc, rtl8733b_bw_mapping(adapter, attrib));
	SET_TX_DESC_SIGNALING_TA_PKT_SC_8733B(desc,
					rtl8733b_sc_mapping(adapter, attrib));
	/*SET_TX_DESC_RTY_LMT_EN_8733B(ptxdesc, 1);*/
	SET_TX_DESC_RTS_DATA_RTY_LMT_8733B(desc, 5);
	SET_TX_DESC_NDPA_8733B(desc, 1);
	SET_TX_DESC_NAVUSEHDR_8733B(desc, 1);
	/*SET_TX_DESC_QSEL_8733B(desc, QSLT_MGNT);*/
	/*
	 * NSS2MCS0 for VHT
	 * MCS8 for HT
	 */
	SET_TX_DESC_DATARATE_8733B(desc, MRateToHwRate(attrib->rate));
	/*SET_TX_DESC_USE_RATE_8733B(desc, 1);*/
	/*SET_TX_DESC_MACID_8733B(desc, pattrib->mac_id);*/ /* ad-hoc mode */
	/*SET_TX_DESC_G_ID_8733B(desc, 63);*/
	/*
	 * partial AID of 1st STA, at infrastructure mode, either SU or MU;
	 * MACID, at ad-hoc mode
	 *
	 * For WMAC to restore the received CSI report of STA1.
	 * WMAC would set p_aid field to 0 in PLCP header for MU.
	 */
	/*SET_TX_DESC_P_AID_8733B(desc, pattrib->txbf_p_aid);*/
	SET_TX_DESC_SND_PKT_SEL_8733B(desc, attrib->bf_pkt_type);
#endif /* CONFIG_BEAMFORMING */
}

void rtl8733b_cal_txdesc_chksum(PADAPTER adapter, u8 *ptxdesc)
{
	struct halmac_adapter *halmac;
	struct halmac_api *api;


	halmac = adapter_to_halmac(adapter);
	api = HALMAC_GET_API(halmac);

	api->halmac_fill_txdesc_checksum(halmac, ptxdesc);
}


#ifdef CONFIG_MP_INCLUDED
void rtl8733b_prepare_mp_txdesc(PADAPTER adapter, struct mp_priv *pmp_priv)
{
	u8 *desc;
	struct pkt_attrib *attrib;
	u32 pkt_size;
	s32 bmcast;
	u32 desc_size;
	u8 data_rate, pwr_status, offset;


	desc = pmp_priv->tx.desc;
	attrib = &pmp_priv->tx.attrib;
	pkt_size = attrib->last_txcmdsz;
	bmcast = IS_MCAST(attrib->ra);
	desc_size = rtl8733b_get_tx_desc_size(adapter);

	SET_TX_DESC_TXPKTSIZE_8733B(desc, pkt_size);

	offset = desc_size;
	SET_TX_DESC_OFFSET_8733B(desc, offset);
#if defined(CONFIG_PCI_HCI)
	SET_TX_DESC_PKT_OFFSET_8733B(desc, 0); /* 8733BE pkt_offset is 0 */
#else
	SET_TX_DESC_PKT_OFFSET_8733B(desc, 1);
#endif

	if (bmcast)
		SET_TX_DESC_BMC_8733B(desc, 1);

	SET_TX_DESC_MACID_8733B(desc, attrib->mac_id);
	SET_TX_DESC_RATE_ID_8733B(desc, attrib->raid);
	SET_TX_DESC_QSEL_8733B(desc, attrib->qsel);

	if (pmp_priv->preamble)
		SET_TX_DESC_DATA_SHORT_8733B(desc, 1);

	if (!attrib->qos_en)
		SET_TX_DESC_EN_HWSEQ_8733B(desc, 1);
	else
		SET_TX_DESC_SW_SEQ_8733B(desc, attrib->seqnum);

	if (pmp_priv->bandwidth <= CHANNEL_WIDTH_160)
		SET_TX_DESC_DATA_BW_8733B(desc, pmp_priv->bandwidth);
	else {
		RTW_ERR("%s: unknown bandwidth %d, use 20M\n",
			 __FUNCTION__, pmp_priv->bandwidth);
		SET_TX_DESC_DATA_BW_8733B(desc, CHANNEL_WIDTH_20);
	}

	SET_TX_DESC_DISDATAFB_8733B(desc, 1);
	SET_TX_DESC_USE_RATE_8733B(desc, 1);
	SET_TX_DESC_DATARATE_8733B(desc, pmp_priv->rateidx);
}
#endif /* CONFIG_MP_INCLUDED */

void fill_default_txdesc(struct xmit_frame *pxmitframe, u8 *pbuf)
{
	PADAPTER adapter;
	PHAL_DATA_TYPE hal;
	struct mlme_ext_priv *pmlmeext;
	struct mlme_ext_info *pmlmeinfo;
	struct pkt_attrib *pattrib;
	s32 bmcst;
	u32 desc_size;
	u8 hw_port;

